/*
Создать нов проэкт. Написать программу, кот выводит на экран фразу:
"The area of rectangle with sides 21 and 17 is ... ."
Вместо многоточия программа должна сосчитать площадь прямоугольника и вывести число.
 */

public class Main {
    public static void main(String[] args) {

        System.out.println(" \" The area of rectangle with sides 21 and 17 is  " + 17*21 + " .\"");
    }
}